erp3l/src/Documents/УстановкаТребованийКвалификацииКНоменклатуреПоставщиков/УстановкаТребованийКвалификацииКНоменклатуреПоставщиков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УстановкаТребованийКвалификацииКНоменклатуреПоставщиков</name>
  <registerRecords>InformationRegister.ТребованияКвалификацииКНоменклатуреПоставщиков</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Требования</name>
    <attributes>
      <name>ТребованиеКПоставщику</name>
      <type>
        <types>CatalogRef.ТребованияКПоставщикам</types>
      </type>
    </attributes>
    <attributes>
      <name>Критерий</name>
      <type>
        <types>CatalogRef.КритерииВыбора</types>
      </type>
    </attributes>
    <attributes>
      <name>ТребованиеКДокументу</name>
      <type>
        <types>CatalogRef.ТребованияКСоставуДокументов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

erp3l/src/Documents/УстановкаТребованийКвалификацииКНоменклатуреПоставщиков/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
	
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТребованияКвалификацииКНоменклатуреПоставщиков.Записывать = Истина;
	Для Каждого ТекСтрокаТребования Из Требования Цикл
		Движение = Движения.ТребованияКвалификацииКНоменклатуреПоставщиков.Добавить();
		Движение.Период = Дата;
		Движение.Организация = Организация;
		Движение.Номенклатура = Номенклатура;
		Движение.ТребованиеКПоставщику = ТекСтрокаТребования.ТребованиеКПоставщику;
		Движение.Критерий = ТекСтрокаТребования.Критерий;
		Движение.ТребованиеКДокументу = ТекСтрокаТребования.ТребованиеКДокументу;
	КонецЦикла;
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры


#КонецЕсли
